app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `questions`
---
    public function index()
    {
    	//Latest function always uses created_at attribute not updated_at
	    //oldest() function is also there.
	    //with('owner') is used for Eager Loading.
	    /*
	     * In eager loading, all questions will be selected from database and all users of the question will also be selected.
	     * If this is not used, then while printing the author of each question, a new query will be fired to database just to get the user from the question id.
	     * This makes a lot of queries and this is called lazy loading.
	     * Hence this makes a lot of difference in performance.
	     * You can check the queries used by installing the laravel debugbar
	     * To install use command:
	     * composer require barryvdh/laravel-debugbar --dev
	     */
    	$questions = Question::with('owner')->latest()->paginate(10);